Revit 2027 API
FamilyInstance.GetReferenceType Method
 Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceReferenceType GetReferenceType(
	Reference reference
)
Public Function GetReferenceType (
	reference As Reference
) As FamilyInstanceReferenceType
public:
FamilyInstanceReferenceType GetReferenceType(
	Reference^ reference
)
member GetReferenceType :
        reference : Reference -> FamilyInstanceReferenceType
Parameters
reference Reference
 The family instance reference.
Return Value
FamilyInstanceReferenceType
 Returns the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference. Returns FamilyInstanceReferenceType.NotAReference if the instance reference doesn't correspond to a reference plane or line in the family.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace